//val
//val(a,b,c).a-строка; b-числовое или перечисляемое значение; c-типо word;
var
  a: string;
  c: word;
  b: real;
  i: longint;
  //***************************************************************//
  //                     Пример из другой программы               //
  //*************************************************************//
  a1: Integer;
  err: Integer;
  b1: string;

begin
    //Преобразуем целое десятичное число
  val('100', i, c);
  writeln(i, ' = 100 dec');
  
    //Преобразуем целое шестнадцатериччное число
  val('0x64', i, c);
  writeln(i, ' = 0x64 hex');
  
    //Преобразуем целое шестнадцатериччное число
  val('$64', i, c);
  writeln(i, ' = $64 hex');
  
    //Преобразуем целое восмеричное число
  val('&144', i, c);
  writeln(i, ' = &144 oct');
  
    //Преобразуем целое двоичное число
  val('%01100100', i, c);
  writeln(i, ' = %01100100 bin');
  
    //Преобразуем вещественное число
  val('3.14', b, c);
  writeln(b:0:4);
  
  
   {//Преобразуем перечисление
    val('summer',a,c);
    writeln(a);
   //Но тут ошибка}
  writeln;
   //Пытаемся преобразовать неправильное вещественное число
   //В переменной с будет число 2, т.к. .. во 2 символе ошибкка .. в строковых
   //представлениях вещественных чисел должна быть точка,
   //а не запятая
  val('3,14', b, c);
  if c = 0 then writeln(b:0:4)
  else writeln('Error at character index ', c);
  
     //---------------------------------------------------//
  //***************************************************************//
  //                     Пример из другой программы               //
  //*************************************************************//
  repeat
    WriteLn('Enter integer number. ');
    readln(b1);
    val(b1, a1, err);
  until err = 0;
  WriteLn('Your number', a1);
  
  
  writeln('Press  ENTER...');
  readln;
end.

